tests_in_kafka2g/pruebas.txt
KAFKA2G

docker exec -it d51a669d460b /opt/kafka/bin/kafka-topics.sh --create --topic kafka2g-test-1 --bootstrap-server localhost:9094 --partitions 3 --replication-factor 1

Inicia carga de 1MM de registros de 100 bytes a 10k tps  

docker exec -it d51a669d460b /opt/kafka/bin/kafka-producer-perf-test.sh --topic kafka2g-test-1 --num-records 1000000 --record-size 100 --throughput 10000 --producer-props bootstrap.servers=localhost:9094
50002 records sent, 10000.4 records/sec (0.95 MB/sec), 2.8 ms avg latency, 246.0 ms max latency.
50010 records sent, 10002.0 records/sec (0.95 MB/sec), 0.2 ms avg latency, 4.0 ms max latency.
50010 records sent, 10002.0 records/sec (0.95 MB/sec), 0.2 ms avg latency, 8.0 ms max latency.
50000 records sent, 10000.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 4.0 ms max latency.
50020 records sent, 10000.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 4.0 ms max latency.
50010 records sent, 10002.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 6.0 ms max latency.
50000 records sent, 10000.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 2.0 ms max latency.
50000 records sent, 10000.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 3.0 ms max latency.
50010 records sent, 10002.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 2.0 ms max latency.
50000 records sent, 9998.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 5.0 ms max latency.
50010 records sent, 10002.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 2.0 ms max latency.
50020 records sent, 10002.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 4.0 ms max latency.
50010 records sent, 10000.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 1.0 ms max latency.
50010 records sent, 10002.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 5.0 ms max latency.
50009 records sent, 10001.8 records/sec (0.95 MB/sec), 1.4 ms avg latency, 109.0 ms max latency.
50011 records sent, 10000.2 records/sec (0.95 MB/sec), 0.1 ms avg latency, 1.0 ms max latency.
50010 records sent, 9998.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 3.0 ms max latency.
50000 records sent, 10000.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 1.0 ms max latency.
50010 records sent, 10000.0 records/sec (0.95 MB/sec), 0.1 ms avg latency, 1.0 ms max latency.
1000000 records sent, 9999.700009 records/sec (0.95 MB/sec), 0.33 ms avg latency, 246.00 ms max latency, 0 ms 50th, 1 ms 95th, 1 ms 99th, 49 ms 99.9th.

Rango de tiempo del CPU desde grafana > CPU Usage-data-2024-06-20 23_17_05
Rango de tiempo del MEM desde grafana > Memory Usage-data-2024-06-20 23_17_10
Imagen desde grafana screen capture > Screenshot 2024-06-20 231640

Inicia carga de 2MM de registros de 1KB a 20k tps 

docker exec -it d51a669d460b /opt/kafka/bin/kafka-producer-perf-test.sh --topic kafka2g-test-1 --num-records 2000000 --record-size 1000 --throughput 20000 --producer-props bootstrap.servers=localhost:9094
99982 records sent, 19992.4 records/sec (19.07 MB/sec), 4.3 ms avg latency, 184.0 ms max latency.
100020 records sent, 20004.0 records/sec (19.08 MB/sec), 0.2 ms avg latency, 7.0 ms max latency.
100040 records sent, 20004.0 records/sec (19.08 MB/sec), 1.3 ms avg latency, 100.0 ms max latency.
100016 records sent, 20003.2 records/sec (19.08 MB/sec), 0.2 ms avg latency, 2.0 ms max latency.
100004 records sent, 19996.8 records/sec (19.07 MB/sec), 0.2 ms avg latency, 3.0 ms max latency.
100000 records sent, 20000.0 records/sec (19.07 MB/sec), 56.1 ms avg latency, 691.0 ms max latency.
97104 records sent, 19420.8 records/sec (18.52 MB/sec), 63.4 ms avg latency, 637.0 ms max latency.
102936 records sent, 20583.1 records/sec (19.63 MB/sec), 2.5 ms avg latency, 146.0 ms max latency.
100000 records sent, 20000.0 records/sec (19.07 MB/sec), 0.2 ms avg latency, 2.0 ms max latency.
100020 records sent, 20000.0 records/sec (19.07 MB/sec), 22.4 ms avg latency, 446.0 ms max latency.
100020 records sent, 20000.0 records/sec (19.07 MB/sec), 11.0 ms avg latency, 313.0 ms max latency.
100000 records sent, 20000.0 records/sec (19.07 MB/sec), 5.9 ms avg latency, 226.0 ms max latency.
100000 records sent, 20000.0 records/sec (19.07 MB/sec), 0.2 ms avg latency, 1.0 ms max latency.
100019 records sent, 20003.8 records/sec (19.08 MB/sec), 0.2 ms avg latency, 5.0 ms max latency.
100001 records sent, 20000.2 records/sec (19.07 MB/sec), 0.2 ms avg latency, 1.0 ms max latency.
100020 records sent, 20000.0 records/sec (19.07 MB/sec), 0.2 ms avg latency, 2.0 ms max latency.
99980 records sent, 19996.0 records/sec (19.07 MB/sec), 0.2 ms avg latency, 5.0 ms max latency.
100020 records sent, 20004.0 records/sec (19.08 MB/sec), 0.2 ms avg latency, 5.0 ms max latency.
87480 records sent, 3993.6 records/sec (3.81 MB/sec), 0.4 ms avg latency, 17530.0 ms max latency.
2000000 records sent, 17762.778098 records/sec (16.94 MB/sec), 292.17 ms avg latency, 17531.00 ms max latency, 0 ms 50th, 229 ms 95th, 16677 ms 99th, 17447 ms 99.9th.

Rango de tiempo del CPU desde grafana > CPU Usage-data-2024-06-20 23_14_48
Rango de tiempo del MEM desde grafana > Memory Usage-data-2024-06-20 23_14_53
Imagen desde grafana screen capture > Screenshot 2024-06-20 231023

Inicia carga de 2MM de registros de 1KB a 50k tps

PS C:\WINDOWS\system32> docker exec -it d51a669d460b /opt/kafka/bin/kafka-producer-perf-test.sh --topic kafka2g-test-1 --num-records 2000000 --record-size 1000 --throughput 50000 --producer-props bootstrap.servers=localhost:9094
249952 records sent, 49990.4 records/sec (47.67 MB/sec), 11.9 ms avg latency, 205.0 ms max latency.
250050 records sent, 50010.0 records/sec (47.69 MB/sec), 0.3 ms avg latency, 2.0 ms max latency.
250050 records sent, 50010.0 records/sec (47.69 MB/sec), 0.3 ms avg latency, 6.0 ms max latency.
222064 records sent, 42712.8 records/sec (40.73 MB/sec), 9.3 ms avg latency, 757.0 ms max latency.
96000 records sent, 3624.7 records/sec (3.46 MB/sec), 1265.6 ms avg latency, 25002.0 ms max latency.
791728 records sent, 158313.9 records/sec (150.98 MB/sec), 1162.9 ms avg latency, 26171.0 ms max latency.
2000000 records sent, 37880.222736 records/sec (36.13 MB/sec), 536.01 ms avg latency, 26171.00 ms max latency, 133 ms 50th, 672 ms 95th, 24749 ms 99th, 25994 ms 99.9th.

Rango de tiempo del CPU desde grafana > CPU Usage-data-2024-06-20 23_12_08
Rango de tiempo del MEM desde grafana > Memory Usage-data-2024-06-20 23_12_14
Imagen desde grafana screen capture > Screenshot 2024-06-20 231050